#+TITLE: input_lang_get_icon

Returns the current keyboard input language with a flag emoji. Needs hammerspoon's CLI client at =/usr/local/bin/hs=, and currently only supports English and Persian, on macOS.

* Installation
#+begin_example zsh
cargo install --git https://github.com/NightMachinary/input_lang_get_icon --force
#+end_example

* Usage
#+begin_src bash :results verbatim :exports both :wrap example
input_lang_get_icon
#+end_src

#+RESULTS:
#+begin_example
🇺🇸
#+end_example
